
## Plan Result




<pre><code>Plan: 2 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * module.judicial_servicebus_namespace_name.azurerm_servicebus_namespace.servicebus_namespace
  * module.judicial_servicebus_namespace_name.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
* Update
  * azurerm_resource_group.rg
  * module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.storage_account.azurerm_storage_account.storage_account
  * module.storage_account_rd_commondata.azurerm_storage_account.storage_account
  * module.storage_account_rd_location.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name     = "rd-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#referencedata"
          - "Team Name"    = "ReferenceData"
          - "environment"  = "aat"
          - "lastUpdated"  = "2022-11-28T13:51:40Z"
          - "managedBy"    = "ReferenceData"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.judicial_servicebus_namespace_name.azurerm_servicebus_namespace.servicebus_namespace will be created
  + resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "uksouth"
      + minimum_tls_version                 = (known after apply)
      + name                                = "rd-servicebus-aat"
      + public_network_access_enabled       = true
      + resource_group_name                 = "rd-aat"
      + sku                                 = "Standard"
      + tags                                = {
          + "Destroy Me"   = "No"
          + "Team Contact" = "#referencedata"
          + "Team Name"    = "ReferenceData"
          + "environment"  = "aat"
          + "managedBy"    = "ReferenceData"
        }
      + zone_redundant                      = false
    }

  # module.judicial_servicebus_namespace_name.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + namespace_id                      = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat|rd-aat"
        name                       = "rd-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdaat"
        name                              = "rdaat"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/rd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#referencedata"
            "application"            = "reference-data"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#ref-data-support"
            "environment"            = "staging"
            "managedBy"              = "Reference Data"
        }
        # (36 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "109.147.123.122",
              - "109.148.101.156",
              - "109.154.187.15",
              - "109.154.187.246",
              - "151.228.157.93",
              - "151.229.192.204",
              - "79.78.126.124",
              - "79.79.136.118",
              - "79.79.141.243",
              - "81.170.87.29",
              - "82.25.248.223",
              - "82.39.20.17",
              - "90.210.202.86",
              - "92.40.214.69",
              - "92.8.180.211",
            ]
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.storage_account_rd_commondata.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdcommondataaat"
        name                              = "rdcommondataaat"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/rd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#referencedata"
            "application"            = "reference-data"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#ref-data-support"
            "environment"            = "staging"
            "managedBy"              = "Reference Data"
        }
        # (36 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "109.154.187.15",
              - "151.228.157.93",
              - "90.210.202.86",
              - "92.40.168.77",
              - "92.40.168.78",
              - "92.40.168.79",
              - "92.40.168.81",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account_rd_location.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdlocationaat"
        name                              = "rdlocationaat"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/rd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#referencedata"
            "application"            = "reference-data"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#ref-data-support"
            "environment"            = "staging"
            "managedBy"              = "Reference Data"
        }
        # (36 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "151.228.92.100",
              - "81.103.33.161",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":156,"Program":"tfcmt","SHA1":"","Vars":{}} -->